Клубный_рейтинг_РАЗРАБОТКА/src/InformationRegisters/КоэффициентыРейтингаПоСчетуВстречи/КоэффициентыРейтингаПоСчетуВстречи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КоэффициентыРейтингаПоСчетуВстречи</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СчетВыигравшего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетПроигравшего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Клубный_рейтинг_РАЗРАБОТКА/src/InformationRegisters/КоэффициентыРейтингаПоСчетуВстречи/ManagerModule.bsl
Функция НайтиКэфПоСчету(парДата, СчетВыигравшего, СчетПроигравшего) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекДата", парДата);
	Запрос.УстановитьПараметр("СчетВ", СчетВыигравшего);
	Запрос.УстановитьПараметр("СчетП", СчетПроигравшего);	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КоэффициентыРейтингаПоСчетуВстречиСрезПоследних.Коэффициент
	|ИЗ
	|	РегистрСведений.КоэффициентыРейтингаПоСчетуВстречи.СрезПоследних(&ТекДата, СчетВыигравшего = &СчетВ
	|	И СчетПроигравшего = &СчетП) КАК КоэффициентыРейтингаПоСчетуВстречиСрезПоследних";

	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() > 0 Тогда
		Возврат Результат[0].Коэффициент;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции
